{
	"actions" : 
	{
		"count" : 1,
		"data" : 
		[
			{
				"class name" : "action",
				"host url" : "http://localhost",
				"name" : "Mental Health",
				"object id" : "1012638136365359060811666331781839957994",
				"owner vsID" : "unique_vsID_for_epsilon"
			}
		]
	},
	"created" : 
	{
		"time" : "2024-06-11T15:30:00+0000"
	},
	"from" : 
	{
		"home" : 
		{
			"latitude" : 0.10000000000000001,
			"longitude" : 0.20000000000000001
		},
		"name" : "Epsilon",
		"vsID" : "1012638136365359060811666331781839957994"
	},
	"id" : "1012638136365359060811666331781839957994_68",
	"is published" : true,
	"keys" : 
	{
		"count" : 3,
		"data" : 
		[
			{
				"key" : "Epsilon"
			},
			{
				"key" : "ecs36b"
			},
			{
				"key" : "final"
			}
		]
	},
	"links" : 
	{
		"count" : 1,
		"data" : 
		[
			{
				"class name" : " google document",
				"host url" : "http://localhost",
				"object id" : "document_id",
				"owner vsID" : "1012638136365359060811666331781839957994",
				"url" : "https://docs.google.com/document/d/1ZhjPzTxFfzgQTvza6I5pvdWFQm6sHTifAkuvilAK3aw/edit?usp=sharing"
			}
		]
	},
	"location" : 
	{
		"latitude" : 0.10000000000000001,
		"longitude" : 0.20000000000000001
	},
	"message" : 
	{
		"content" : "We want to make the student community better by adding a Mental Health Monitoring System(MHMS) for students. After they finish homework or exams, students will answer surveys to tell us how they're feeling mentally. This system will create weekly reports showing stress levels and mental health trends among students. If students are feeling stressed, the system will suggest they take breaks or do activities to relax. Our goal is to create a healthier academic environment by focusing on student well-being. Students who give honest answers in the surveys will earn a 5% credit at the end of the session. However, if someone tries to cheat by giving unrealistic answers twice, they'll lose 0.5% of any extra credit they've earned. This feature encourages honesty and helps us support students better, keeping everything fair and aligned with our educational goals.Implementing the Mental Health Monitoring System(MHMS) within the Post platform involves several key steps. First, we will integrate a MentalHealthSurvey class to manage and evaluate student responses after each homework submission and term examination. This class will calculate mental health and stress scores based on predefined criteria, storing this data within an extended Student class that includes methods for updating and retrieving these scores. Weekly reports generated by the MentalHealthReport class will provide insights into students' well-being trends, recommending personalized interventions such as breaks or stress-relief activities for those showing high stress levels.For instance, if a student consistently reports elevated stress after assignments, the system may suggest mindfulness exercises or counseling services. This approach not only enhances student support but also promotes a proactive approach to mental health management in academic settings, fostering a conducive learning environment.Proposed By Team Epsilon - Shreyash, Stephanie"
	},
	"to" : 
	{
		"count" : 1,
		"data" : 
		[
			{
				"home" : 
				{
					"latitude" : 0.10000000000000001,
					"longitude" : 0.20000000000000001
				},
				"name" : "Epsilon",
				"vsID" : "68"
			}
		]
	},
	"updated" : 
	{
		"time" : "2024-06-11T15:30:00+0000"
	}
}
